agenda_app/app/controllers/appointments_controller.rb

    def index
        @appointments = Appointment.all
---
SELECT "appointments".* FROM "appointments" WHERE (date = 2016-02-02)

      def create
        if params[:get]
          @appointments = Appointment.where(["date = :date", { date: params[:date] }])
          render json: {
            appointments: @appointments
          }
        else
          appointment = Appointment.new(appointment_params)

          if appointment.save
---
SELECT "appointments".* FROM "appointments" WHERE (date = 'March 6th 2019')
INSERT INTO "appointments" ("name", "date", "description", "calendar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Blah "], ["date", "Blah "], ["description", "Blah "], ["calendar", ""], ["created_at", "2019-03-05 19:11:13.427266"], ["updated_at", "2019-03-05 19:11:13.427266"]]